/*********************************************************************************************
* 文件：sensor.c
* 作者：fuyou 2018.10.24
* 说明：GreenHouse-1节点驱动
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "sensor.h"
/*********************************************************************************************
* 宏定义
*********************************************************************************************/

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static uint8 D0 = 0xFF;                                         // 默认打开主动上报功能
static uint8 D1 = 0;                                            // 继电器初始状态为全关
static float A0 = 0.0;                                          // A0存储温度值
static float A1 = 0.0;                                          // A1存储湿度值
static float A2 = 0.0;                                          // A2存储光照值
static uint16 A3 = 0;                                           // A3存储空气质量
static float A7 = 0;                                            // A7存储电池电压
static uint16 V0 = 30;                                          // V0设置为上报时间间隔，默认为30s
unsigned short motorTick=0;

float BatteryVoltage_Get();

/*********************************************************************************************
* 名称：updateV0()
* 功能：更新V0的值
* 参数：*val -- 待更新的变量
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateV0(char *val)
{
    //将字符串变量val解析转换为整型变量赋值
    V0 = atoi(val);                                 // 获取数据上报时间更改值
}
/*********************************************************************************************
* 名称：updateA0()
* 功能：更新A0的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA0(void)
{
    // 读取温度值，并更新A0
    A0 = (htu21d_get_data(TEMP)/100.0f);

}
/*********************************************************************************************
* 名称：updateA1()
* 功能：更新A1的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA1(void)
{
    // 读取湿度值，并更新A1
    A1 = (htu21d_get_data(HUMI)/100.0f);
}
/*********************************************************************************************
* 名称：updateA2()
* 功能：更新A2的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA2(void)
{
    // 读取光照值，并更新A2
    A2 = bh1750_get_data();
}
/*********************************************************************************************
* 名称：updateA3()
* 功能：更新A3的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA3(void)
{
    // 读取空气有害气体浓度值，并更新A3
    A3 = get_airgas_data();
}
/*********************************************************************************************
* 名称：updateA4()
* 功能：更新A4的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA4(void)
{
}
/*********************************************************************************************
* 名称： updateA5()
* 功能：跌倒检测并上报状态
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA5(void)
{
}
/*********************************************************************************************
* 名称：updateA6()
* 功能：更新A6的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA6(void)
{
}
/*********************************************************************************************
* 名称： updateA7()
* 功能：监测语音识别数据，更新A7的值
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void updateA7(void)
{
    /* 获取板载电压 */
    A7 = BatteryVoltage_Get();
}

/*********************************************************************************************
* 名称：BatteryVoltage_init()
* 功能：电池电压测量初始化
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void BatteryVoltage_init()
{
    P0SEL |= (1<<4);                                            //端口0_4 功能选择外设功能
    P0DIR &= ~(1<<4);                                           //设置输入模式
    APCFG |= (1<<4);                                            //模拟 I/O 使能
}

/*********************************************************************************************
* 名称：BatteryVoltage_init()
* 功能：电池电压测量初始化
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
float BatteryVoltage_Get()
{
    unsigned short adcValue=0;
    float value=0;

    adcValue = HalAdcRead(HAL_ADC_CHANNEL_4,HAL_ADC_RESOLUTION_12);
    value = ((float)adcValue*(3.3/2047.0))*13.6/3.6;
    return value;                                               //返回有效值
}

/*********************************************************************************************
* 名称：sensorInit()
* 功能：传感器硬件初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorInit(void)
{
    // 初始化传感器代码
    relay_init();                                               // 继电器初始化
    htu21d_init();                                              // 温湿度传感器初始化
    bh1750_init();                                              // 光强度传感器初始化
    airgas_init();                                              // 空气质量传感器初始化
    fan_init();                                                 // 风扇初始化
    stepmotor_init();                                           // 步进电机初始化
    BatteryVoltage_init();                                      // 电压测量初始化

    // 启动定时器，触发传感器上报数据事件：MY_REPORT_EVT
    osal_start_timerEx(sapi_TaskID, MY_REPORT_EVT, (uint16)((osal_rand()%10) * 1000));
    // 启动定时器，触发传感器监测事件：MY_CHECK_EVT
    osal_start_timerEx(sapi_TaskID, MY_CHECK_EVT, 100);
}
/*********************************************************************************************
* 名称：sensorLinkOn()
* 功能：传感器节点入网成功调用函数
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorLinkOn(void)
{
    sensorUpdate();
}
/*********************************************************************************************
* 名称：sensorUpdate()
* 功能：处理主动上报的数据
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorUpdate(void)
{
    char pData[16];
    char *p = pData;

    
    ZXBeeBegin();                                                 // 智云数据帧格式包头

    // 根据D0的位状态判定需要主动上报的数值
    if ((D0 & 0x01) == 0x01)                                      // 若温度上报允许，则pData的数据包中添加温度数据
    {
        updateA0();
        sprintf(p, "%.1f", A0);
        ZXBeeAdd("A0", p);
    }
    if ((D0 & 0x02) == 0x02)                                      // 若湿度上报允许，则pData的数据包中添加湿度数据
    {
        updateA1();
        sprintf(p, "%.1f", A1);
        ZXBeeAdd("A1", p);
    }
    if ((D0 & 0x04) == 0x04)                                      // 若光照上报允许，则pData的数据包中添加光照数据
    {
        updateA2();
        sprintf(p, "%.1f", A2);
        ZXBeeAdd("A2", p);
    }
    if ((D0 & 0x08) == 0x08)                                      // 若空气质量上报允许，则pData的数据包中添加空气质量数据
    {
        updateA3();
        sprintf(p, "%u", A3);
        ZXBeeAdd("A3", p);
    }
    if ((D0 & (1<<7)) == (1<<7))                                      // 若大气压力上报允许，则pData的数据包中添加大气压力数据
    {
        //updateA7();
        sprintf(p, "%.1f", A7);
        ZXBeeAdd("A7", p);
    }

    sprintf(p, "%u", D1);                                  // 上报控制编码
    ZXBeeAdd("D1", p);

    p = ZXBeeEnd();                                               // 智云数据帧格式包尾
    if (p != NULL)
    {
        ZXBeeInfSend(p, strlen(p));	                                // 将需要上传的数据进行打包操作，并通过zb_SendDataRequest()发送到协调器
    }
}

/*********************************************************************************************
* 名称：sensorCheck()
* 功能：传感器监测
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorCheck(void)
{
    updateA7();
}
/*********************************************************************************************
* 名称：sensorControl()
* 功能：传感器控制
* 参数：cmd - 控制命令
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void sensorControl(uint8 cmd)
{
    static uint8 stepmotor_dir=0;
    
    /* 电机控制 */
    if(cmd & 0x01)
    {
        if(!stepmotor_dir)
        {
            stepmotor_dir=1;
            forward(5000);
        }
    }
    else
    {
        if(stepmotor_dir)
        {
            stepmotor_dir=0;
            reversion(5000);
        }
    }

    /* 风扇控制 */
    if(cmd & 0x02)
    {
        FANIO = FAN_ON;                                         // 开启风扇
    }
    else
    {
        FANIO = FAN_OFF;                                        // 开启风扇
    }
    
    /*继电器控制*/
    if(D1&0x04)
        relay_on(0x01);
    else
        relay_off(0x01);
    
    if(D1&0x08)
        relay_on(0x02);
    else
        relay_off(0x02);
}
/*********************************************************************************************
* 名称：ZXBeeUserProcess()
* 功能：解析收到的控制命令
* 参数：*ptag -- 控制命令名称
*       *pval -- 控制命令参数
* 返回：<0:不支持指令，>=0 指令已处理
* 修改：
* 注释：
*********************************************************************************************/
int ZXBeeUserProcess(char *ptag, char *pval)
{
    int val;
    int ret = 0;
    char pData[16];
    char *p = pData;

    // 将字符串变量pval解析转换为整型变量赋值
    val = atoi(pval);
    // 控制命令解析
    if (0 == strcmp("CD0", ptag))                                 // 对D0的位进行操作，CD0表示位清零操作
    {
        D0 &= ~val;
    }
    if (0 == strcmp("OD0", ptag))                                 // 对D0的位进行操作，OD0表示位置一操作
    {
        D0 |= val;
    }
    if (0 == strcmp("D0", ptag))                                  // 查询上报使能编码
    {
        if (0 == strcmp("?", pval))
        {
            ret = sprintf(p, "%u", D0);
            ZXBeeAdd("D0", p);
        }
    }
    if (0 == strcmp("CD1", ptag))                                 // 对D1的位进行操作，CD1表示位清零操作
    {
        D1 &= ~val;
        sensorControl(D1);                                          // 处理执行命令
    }
    if (0 == strcmp("OD1", ptag))                                 // 对D1的位进行操作，OD1表示位置一操作
    {
        D1 |= val;
        sensorControl(D1);                                          // 处理执行命令
    }
    if (0 == strcmp("D1", ptag))                                  // 查询执行器命令编码
    {
        if (0 == strcmp("?", pval))
        {
            ret = sprintf(p, "%u", D1);
            ZXBeeAdd("D1", p);
        }
    }
    if (0 == strcmp("A0", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA0();
            ret = sprintf(p, "%.1f", A0);
            ZXBeeAdd("A0", p);
        }
    }
    if (0 == strcmp("A1", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA1();
            ret = sprintf(p, "%.1f", A1);
            ZXBeeAdd("A1", p);
        }
    }
    if (0 == strcmp("A2", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA2();
            ret = sprintf(p, "%.1f", A2);
            ZXBeeAdd("A2", p);
        }
    }
    if (0 == strcmp("A3", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            updateA3();
            ret = sprintf(p, "%u", A3);
            ZXBeeAdd("A3", p);
        }
    }
    if (0 == strcmp("A7", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            //updateA7();
            ret = sprintf(p, "%.1f", A7);
            ZXBeeAdd("A7", p);
        }
    }
    if (0 == strcmp("V0", ptag))
    {
        if (0 == strcmp("?", pval))
        {
            ret = sprintf(p, "%u", V0);                         	// 上报时间间隔
            ZXBeeAdd("V0", p);
        }
        else
        {
            updateV0(pval);
        }
    }
    
    return ret;
}
/*********************************************************************************************
* 名称：MyEventProcess()
* 功能：自定义事件处理
* 参数：event -- 事件编号
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void MyEventProcess( uint16 event )
{
    if (event & MY_REPORT_EVT)
    {
        sensorUpdate();
        //启动定时器，触发事件：MY_REPORT_EVT
        osal_start_timerEx(sapi_TaskID, MY_REPORT_EVT, V0*1000);
    }
    if (event & MY_CHECK_EVT)
    {
        // 启动定时器，触发事件：MY_CHECK_EVT
        osal_start_timerEx(sapi_TaskID, MY_CHECK_EVT, 100);
        sensorCheck();
    }
}