/*********************************************************************************************
* 文件：stadiometry.c
* 作者：Lixm 2017.10.17
* 说明：红外测距驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stadiometry.h"
#include "delay.h"
/*********************************************************************************************
* 名称：stadiometry_init()
* 功能：红外测距传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void stadiometry_init(void)
{
  APCFG |= 0x10;                                                //模拟 I/O 使能  
  P0SEL |= 0x10;                                                //端口0_4 功能选择外设功能
  P0DIR &= ~0x10;                                               //设置输入模式
  ADCCON3  = 0xB4;                                              //选择AVDD5为参考电压；12分辨率；P0_4  ADC  
  ADCCON1 |= 0x30;                                              //选择ADC的启动模式为手动
}

/*********************************************************************************************
* 名称：float get_stadiometry_data(void)
* 功能：获取红外测距传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
float get_stadiometry_data(void)
{ 
  unsigned int  value = 0;
  ADCCON3  = 0xB4;                                              //选择AVDD5为参考电压；12分辨率；P0_4  ADC    
  ADCCON1 |= 0x30;                                              //选择ADC的启动模式为手动
  ADCCON1 |= 0x40;                                              //启动AD转化             
  
  while(!(ADCCON1 & 0x80));                                     //等待ADC转化结束  
  value =  ADCL >> 2;
  delay_ms(1);
  value |= (ADCH << 6)>> 4;                                     //取得最终转化结果，存入value中  
  if((value >= 86)&&(value <= 750))
      return (2547.8/((float)value*0.75-10.41)-0.42);          //获取距离
    else
      return 0;
  
}