/*********************************************************************************************
* 文件：rgb.c
* 作者：Meixin 2017.09.15
* 说明：rgb灯驱动代码
* 修改：liutong 20171027 修改了rgb控制引脚初始化函数名称、优化了注释、增加了rgb打开和关闭函数
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "rgb.h"

/*********************************************************************************************
* 名称：rgb_init()
* 功能：rgb控制引脚初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void rgb_init(void)
{
    P0SEL &= ~(1<<6);                                           //配置为通用IO模式
    P0DIR |= (1<<6);                                            //配置为输出模式
    P0SEL &= ~(1<<7);                                           //配置为通用IO模式
    P0DIR |= (1<<7);                                            //配置为输出模式

    P1SEL &= ~(1<<2);                                           //配置为通用IO模式
    P1DIR |= (1<<2);                                            //配置为输出模式
    P1SEL &= ~(1<<3);                                           //配置为通用IO模式
    P1DIR |= (1<<3);                                            //配置为输出模式
    P1SEL &= ~(1<<4);                                           //配置为通用IO模式
    P1DIR |= (1<<4);                                            //配置为输出模式
    P1SEL &= ~(1<<5);                                           //配置为通用IO模式
    P1DIR |= (1<<5);                                            //配置为输出模式

    RGB1_R = OFF;                                               //初始状态为关闭
    RGB1_G = OFF;                                               //初始状态为关闭
    RGB1_B = OFF;                                               //初始状态为关闭
    RGB2_R = OFF;                                               //初始状态为关闭
    RGB2_G = OFF;                                               //初始状态为关闭
    RGB2_B = OFF;                                               //初始状态为关闭
}

/*********************************************************************************************
* 名称：rgb_on()
* 功能：rgb控制打开函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，打开rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb1_on(unsigned char rgb)
{
    if(rgb & 0x01)                                              //如果要打开RGB_R
    {
        RGB1_R = ON;
    }
    if(rgb & 0x02)                                              //如果要打开RGB_G
    {
        RGB1_G = ON;
    }
    if(rgb & 0x04)                                              //如果要打开RGB_B
    {
        RGB1_B = ON;
    }
    return 0;
}

/*********************************************************************************************
* 名称：rgb_off()
* 功能：rgb控制关闭函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，关闭rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb1_off(unsigned char rgb)
{
    if(rgb & 0x01)                                              //如果要关闭RGB_R
    {
        RGB1_R = OFF;
    }
    if(rgb & 0x02)                                              //如果要关闭RGB_G
    {
        RGB1_G = OFF;
    }
    if(rgb & 0x04)                                              //如果要关闭RGB_B
    {
        RGB1_B = OFF;
    }
    return 0;
}


/*********************************************************************************************
* 名称：rgb_on()
* 功能：rgb控制打开函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，打开rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb2_on(unsigned char rgb)
{
    if(rgb & 0x01)                                              //如果要打开RGB_R
    {
        RGB2_R = ON;
    }
    if(rgb & 0x02)                                              //如果要打开RGB_G
    {
        RGB2_G = ON;
    }
    if(rgb & 0x04)                                              //如果要打开RGB_B
    {
        RGB2_B = ON;
    }
    return 0;
}

/*********************************************************************************************
* 名称：rgb_off()
* 功能：rgb控制关闭函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，关闭rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb2_off(unsigned char rgb)
{
    if(rgb & 0x01)                                              //如果要关闭RGB_R
    {
        RGB2_R = OFF;
    }
    if(rgb & 0x02)                                              //如果要关闭RGB_G
    {
        RGB2_G = OFF;
    }
    if(rgb & 0x04)                                              //如果要关闭RGB_B
    {
        RGB2_B = OFF;
    }
    return 0;
}