/*********************************************************************************************
* 文件：rgb.h
* 作者：Meixin 2017.09.15
* 说明：rgb灯驱动代码头文件  
* 修改：liutong 20171027 修改了rgb控制引脚初始化函数名称、优化了注释
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __rgb_H__
#define __rgb_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <ioCC2530.h>                                           //引入CC2530所对应的头文件（包含各SFR的定义）

/*********************************************************************************************
* 宏定义
*********************************************************************************************/
#define RGB1_R                      P0_6                            //宏定义RGB_R灯控制引脚
#define RGB1_G                      P0_7                            //宏定义RGB_G灯控制引脚
#define RGB1_B                      P1_2                            //宏定义RGB_B灯控制引脚
#define RGB2_R                      P1_3                            //宏定义RGB_R灯控制引脚
#define RGB2_G                      P1_4                            //宏定义RGB_G灯控制引脚
#define RGB2_B                      P1_5                            //宏定义RGB_B灯控制引脚

#define ON                      0                               //宏定义灯开状态控制为NO
#define OFF                     1                               //宏定义关闭状态控制为OFF

/*********************************************************************************************
* 函数声明
*********************************************************************************************/
void rgb_init(void);                                            //rgb控制引脚初始化函数
signed char rgb1_on(unsigned char rgb);                          //rgb打开控制函数
signed char rgb1_off(unsigned char rgb);                         //rgb关闭控制函数
signed char rgb2_on(unsigned char rgb);                          //rgb打开控制函数
signed char rgb2_off(unsigned char rgb);                         //rgb关闭控制函数


#endif /*__rgb_H_*/

