/*********************************************************************************************
* 文件：key.h
* 作者：chennian 2017.11.08
* 说明：按键驱动代码头文件  
* 修改：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __DRIVE_KEY_H__
#define __DRIVE_KEY_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"

#ifndef NULL
#define NULL 0
#endif
/*********************************************************************************************
* 宏定义
*********************************************************************************************/
#define K1_PIN                GPIO_Pin_12                       //宏定义K1管脚为KEY1_PIN
#define K1_PORT               GPIOB                             //宏定义K1通道为KEY1_PORT
#define K1_CLK                RCC_AHB1Periph_GPIOB              //宏定义KY1时钟为KEY1_CLK

#define K2_PIN                GPIO_Pin_13                       //宏定义K2管脚为KEY2_PIN
#define K2_PORT               GPIOB                             //宏定义K2通道为KEY2_PORT
#define K2_CLK                RCC_AHB1Periph_GPIOB              //宏定义K2时钟为KEY2_CLK

#define K3_PIN                GPIO_Pin_14                       //宏定义K3管脚为KEY3_PIN
#define K3_PORT               GPIOB                             //宏定义K3通道为KEY3_PORT
#define K3_CLK                RCC_AHB1Periph_GPIOB              //宏定义K3时钟为KEY3_CLK

#define K4_PIN                GPIO_Pin_15                       //宏定义K4管脚为KEY4_PIN
#define K4_PORT               GPIOB                             //宏定义K4通道为KEY4_PORT
#define K4_CLK                RCC_AHB1Periph_GPIOB              //宏定义K4时钟为KEY4_CLK        

#define K1_PREESED            0x01                              //宏定义K1数字编号
#define K2_PREESED            0x02                              //宏定义K2数字编号
#define K3_PREESED            0x04                              //宏定义K3数字编号
#define K4_PREESED            0x08                              //宏定义K4数字编号
/*********************************************************************************************
* 函数声明
*********************************************************************************************/
void key_init(void);                                            //按键管脚初始化函数
char get_key_status(void);                                      //按键检测函数
void KeyExitxConfig(void);
void KeySetCallback(void (*f)(int k));
#endif /*__LED_H_*/