/*********************************************************************************************
*文件: onboard_sensors.c
*作者: 
*说明: 板载传感器处理程序
*修改:
*注释:
*********************************************************************************************/
#include <contiki.h>

PROCESS_NAME(BatteryVoltageUpdate);
PROCESS_NAME(htu21d_update);

/*********************************************************************************************
定义进程名
*********************************************************************************************/
PROCESS(onboard_sensors, "onboard_sensors");

/*********************************************************************************************
* 名称: PROCESS_THREAD()
* 功能: 板载传感器处理进程
* 参数: onboard_sensors, ev, data
* 返回: 无
* 修改:
* 注释:
*********************************************************************************************/
PROCESS_THREAD(onboard_sensors, ev, data)
{
    PROCESS_BEGIN();
    
    process_start(&BatteryVoltageUpdate, NULL);
    process_start(&htu21d_update, NULL);
    
    PROCESS_END();
}