#include "ElectronicLock.h"


/*********************************************************************************************
* 名称：ElectronicLock_init()
* 功能：电子锁控制引脚初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void ElectronicLock_init(void)
{
    P1SEL &= ~(1<<2);                                               //配置控制管脚为通用IO模式
    P1DIR |= (1<<2);                                                //配置控制管脚为输出模式
    
    ElectronicLock_off();
}


/*********************************************************************************************
* 名称：ElectronicLockIO_on()
* 功能：ElectronicLockIO控制打开函数
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void ElectronicLock_on()
{
    ElectronicLockIO = 1;
}

/*********************************************************************************************
* 名称：ElectronicLock_off()
* 功能：
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
void ElectronicLock_off()
{
    ElectronicLockIO = 0;
}