/*********************************************************************************************
* 文件：led.c
* 作者：Meixin 2017.09.15
* 说明：LED灯驱动代码     
* 修改：liutong 20171027 修改了LED控制引脚初始化函数名称、优化了注释、增加了LED打开和关闭函数
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "led.h"

/*********************************************************************************************
* 名称：led_init()
* 功能：LED控制引脚初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void led_init(void)
{
    P0SEL &= ~(1<<0);                                               //配置控制管脚为通用IO模式
    P0DIR |= (1<<0);                                                //配置控制管脚为输出模式
    P0SEL &= ~(1<<1);                                               //配置控制管脚为通用IO模式
    P0DIR |= (1<<1);                                                //配置控制管脚为输出模式
    P0SEL &= ~(1<<2);                                               //配置控制管脚为通用IO模式
    P0DIR |= (1<<2);                                                //配置控制管脚为输出模式
    P0SEL &= ~(1<<4);                                               //配置控制管脚为通用IO模式
    P0DIR |= (1<<4);                                                //配置控制管脚为输出模式
    
    LED1 = OFF;                                                     //初始状态为关闭
    LED2 = OFF;                                                     //初始状态为关闭
    LED3 = OFF;                                                     //初始状态为关闭
    LED4 = OFF;                                                     //初始状态为关闭
}

/*********************************************************************************************
* 名称：led_on()
* 功能：LED控制打开函数
* 参数：LED号，在led.h中宏定义为LED1，LED2
* 返回：0，打开LED成功，-1，参数错误
* 修改：
* 注释：参数只能填入LED1，LED2,否则会返回-1
*********************************************************************************************/
signed char led_on(unsigned char led)
{
    if(led&0x01)
    {
        LED1 = ON;
    }
    if(led&0x02)
    {
        LED2 = ON;
    }
    if(led&0x04)
    {
        LED3 = ON;
    }
    if(led&0x08)
    {
        LED4 = ON;
    }
    
    return 0;
}

/*********************************************************************************************
* 名称：led_off()
* 功能：LED控制关闭函数
* 参数：LED号，在led.h中宏定义为LED1，LED2
* 返回：0，关闭LED成功，-1，参数错误
* 修改：
* 注释：参数只能填入LED1，LED2,否则会返回-1
*********************************************************************************************/
signed char led_off(unsigned char led)
{
    if(led&0x01)
    {
        LED1 = OFF;
    }
    if(led&0x02)
    {
        LED2 = OFF;
    }
    if(led&0x04)
    {
        LED3 = OFF;
    }
    if(led&0x08)
    {
        LED4 = OFF;
    }
    
    return 0;
}