/*********************************************************************************************
* 文件：rgb.c
* 作者：Meixin 2017.09.15
* 说明：rgb灯驱动代码     
* 修改：liutong 20171027 修改了rgb控制引脚初始化函数名称、优化了注释、增加了rgb打开和关闭函数
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "rgb.h"

/*********************************************************************************************
* 名称：rgb_init()
* 功能：rgb控制引脚初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void rgb_init(void)
{
  APCFG &= ~0x01;                                                //模拟 I/O 失能
  P0SEL &= ~0x07;                                               //配置控制管脚（p0.4, p0.5）为通用IO模式
  P0DIR |= 0x07;                                                //配置控制管脚（p0.4, p0.5）为输出模式
  
  RGB_R = OFF;                                                     //初始状态为关闭
  RGB_G = OFF;                                                     //初始状态为关闭
  RGB_B = OFF;                                                     //初始状态为关闭
}
  
/*********************************************************************************************
* 名称：rgb_on()
* 功能：rgb控制打开函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，打开rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb_on(unsigned char rgb)
{
  if(rgb == RGB_R){                                                //如果要打开RGB_R
    RGB_R = ON;
    return 0;
  }
    
  if(rgb == RGB_G){                                                //如果要打开RGB_G
    RGB_G = ON;
    return 0;
  }
  
  if(rgb == RGB_B){                                                //如果要打开RGB_B
    RGB_B = ON;
    return 0;
  }
   
  return -1;                                                    //参数错误，返回-1
}

/*********************************************************************************************
* 名称：rgb_off()
* 功能：rgb控制关闭函数
* 参数：rgb号，在rgb.h中宏定义为RGB_R，RGB_G，RGB_B
* 返回：0，关闭rgb成功，-1，参数错误
* 修改：
* 注释：参数只能填入RGB_R，RGB_G，RGB_B否则会返回-1
*********************************************************************************************/
signed char rgb_off(unsigned char rgb)
{
  if(rgb == RGB_R){                                                //如果要关闭RGB_R
    RGB_R = OFF;
    return 0;
  }
    
  if(rgb == RGB_G){                                                //如果要关闭RGB_G
    RGB_G = OFF;
    return 0;
  }

  if(rgb == RGB_B){                                                //如果要关闭RGB_B
    RGB_B = OFF;
    return 0;
  }
  
  return -1;                                                    //参数错误，返回-1
}